Ruby/lab4/lab_four_api/app/controllers/posts_controller.rb

  def index
    @posts = Post.all
---
SELECT "posts".* FROM "posts"

  def create
    @post = Post.new(post_params)

    if @post.save
---
INSERT INTO "posts" ("title", "body", "user_id", "created_at", "updated_at") VALUES ('New Post', 'New post body', 1, '2026-06-14 11:59:47.105892', '2026-06-14 11:59:47.105892') RETURNING "id"

  def update
    if @post.update(post_params)
---
UPDATE "posts" SET "title" = 'Updated Title', "updated_at" = '2026-06-14 11:59:47.200638' WHERE "posts"."id" = 1

  def destroy
    @post.destroy!
---
DELETE FROM "posts" WHERE "posts"."id" = 5

    def set_post
      @post = Post.find(params.expect(:id))
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = 1 LIMIT 1